# Задача №2
import csv

# для выгрузки данных из википедии использовался инструмент запросов PetScan

dict = {'А': 0, 'Б': 0, 'В': 0, 'Г': 0, 'Д': 0, 'Е': 0, 'Ё': 0, 'Ж': 0, 'З': 0, 'И': 0, 'Й': 0,
        'К': 0, 'Л': 0, 'М': 0, 'Н': 0, 'О': 0, 'П': 0, 'Р': 0, 'С': 0, 'Т': 0, 'У': 0, 'Ф': 0,
        'Х': 0, 'Ц': 0, 'Ч': 0, 'Ш': 0, 'Щ': 0, 'Ъ': 0, 'Ы': 0, 'Ь': 0, 'Э': 0, 'Ю': 0, 'Я': 0}

with open('all_animals.csv', encoding='utf-8') as in_f:
    reader = csv.reader(in_f)
    # читаем построчно выгрузку из википедии, ищем заглавную букву (ключ) названия животного в словаре и прибавляем 1 к значению ключа
    for row in reader:
        first_letter = row[1][0]
        if first_letter in dict:
            dict[first_letter] += 1

for item in dict.items():
    print(item[0] + ':', item[1])


